Revit 2027 API
ContinuousRailType.EndOrTopExtensionLength Property
 The extension length of the rail termination at the end or top.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double EndOrTopExtensionLength { get; set; }
Public Property EndOrTopExtensionLength As Double
	Get
	Set
public:
property double EndOrTopExtensionLength {
	double get ();
	void set (double value);
}
member EndOrTopExtensionLength : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for endExtensionLength must be between 0 and 30000 feet.
See Also
Reference
ContinuousRailType Class
Autodesk.Revit.DB.Architecture Namespace